In [22]:
import pandas as pd
from io import StringIO

data = """
ID|Name|Business effective date|Amount|Notes
1|Ruthra Varshan|2023-05-15|1500.50|Project A
2|Chavya Varma|2023-06-20|2750.00|
3|Hema Latha||1800.75|Project C
4|Arjun Khan|2023-07-10||Project D
5||2023-08-05|2200.00|Project E
"""

with open(r'Python/data/pipe_data.csv', 'w') as f:
    f.write(data)

In [24]:
df = pd.read_csv(r'Python/data/pipe_data.csv', delimiter='|')

print("Original Data:")
display(df)

Original Data:

   ID            Name Business effective date   Amount      Notes
0   1  Ruthra Varshan              2023-05-15  1500.50  Project A
1   2    Chavya Varma              2023-06-20  2750.00        NaN
2   3      Hema Latha                     NaN  1800.75  Project C
3   4      Arjun Khan              2023-07-10      NaN  Project D
4   5             NaN              2023-08-05  2200.00  Project E

In [26]:
df = df.replace('\|', '', regex=True)

df = df.dropna(how='all')

df = df.replace('', pd.NA).dropna(how='all')

print("\nCleaned Data:")
display(df)

Cleaned Data:

   ID            Name Business effective date   Amount      Notes
0   1  Ruthra Varshan              2023-05-15  1500.50  Project A
1   2    Chavya Varma              2023-06-20  2750.00        NaN
2   3      Hema Latha                     NaN  1800.75  Project C
3   4      Arjun Khan              2023-07-10      NaN  Project D
4   5             NaN              2023-08-05  2200.00  Project E

In [28]:
# Convert to  dd/mm/yyyy
df['Business effective date'] = pd.to_datetime(
    df['Business effective date'], 
    errors='coerce'  # coerce invalid dates to N
).dt.strftime('%d/%m/%Y')

print("\nData with Formatted Dates:")
display(df)

Data with Formatted Dates:

   ID            Name Business effective date   Amount      Notes
0   1  Ruthra Varshan              15/05/2023  1500.50  Project A
1   2    Chavya Varma              20/06/2023  2750.00        NaN
2   3      Hema Latha                     NaN  1800.75  Project C
3   4      Arjun Khan              10/07/2023      NaN  Project D
4   5             NaN              05/08/2023  2200.00  Project E

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   ID                       5 non-null      int64
 1   Name                     4 non-null      object
 2   Business effective date  4 non-null      object
 3   Amount                   4 non-null      float64
 4   Notes                    4 non-null      object
dtypes: float64(1), int64(1), object(3)
memory usage: 332.0+ bytes

In [41]:
df.dtypes

ID                           int64
Name                        object
Business effective date     object
Amount                     float64
Notes                       object
dtype: object

In [43]:
df['Business effective date'].dtype

dtype('O')